---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.GetHatchingDirection
source: html/1ef246b2-cd85-1ae1-7e48-4de5d4bb6531.htm
---
# Autodesk.Revit.DB.FillGrid.GetHatchingDirection Method

Provides the hatching propagation. Hatching is inverted.

## Syntax (C#)
```csharp
public UV GetHatchingDirection()
```

## Returns
The direction of hatching.